---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeDefinition
source: html/809d6adf-9335-55b2-5a84-5462dbabeb3e.htm
---
# RebarShapeDefinition Properties

Report whether the shape definition is fully
 constrained.